import streamlit as st

def Info_tab():
    st.write("""
# Πληροφορίες Σελίδας

## Γενικές Πληροφορίες για την Σελίδα

Η συγκεκριμένη εφαρμογή χρησιμοποιείται για την οπτικοποίηση δεδομένων και σύγκριση αλγορίθμων μηχανικής μάθησης όπου για να επιτευχθεί αυτή η λειτουργία γίνεται χρήση του εργαλείου Streamlit. Πιο συγκεκριμένα, η εφαρμογή υποστηρίζει τις εξής λειτουργίες:
  - Φόρτωση δεδομένων (.csv, Excel).
  - Οπτικοποιήσεις πινάκων (Dataloader).
  - 2D οπτικοποιήσεις βασισμένες σε διαφορετικούς αλγορίθμους.
  - Μηχανική Μάθηση όπου δίνονται δύο επιλογές ειδών αλγορίθμων για τον χρήστη (κατηγοριοποίησης ή ομαδοποίησης) όπου συγκρίνει και εντοπίζει ποιος είναι ο πιο αποδοτικός.
  - Μια ενημερωτική σελίδα σχετικά με τον τρόπο λειτουργίας της εφαρμογής (Η συγκεκριμένη σελίδα).

## Εγχειρίδιο Χρήσης

Στην αρχική σελίδα εμφανίζεται ένα πλαίσιο όπου ζητάει να ανέβει ένα αρχείο σε μορφή CSV, Excel. Έφοσον ανέβει αυτό το αρχείο οι επιλογές που βρίσκονται στο πάνω μέρος της σελίδας γίνονται πλέον λειτουργικές. Οι επιλογές αυτές είναι Data Loader (κυρίως), 2D visualization, Machine learning, Info (τρέχουσα σελίδα).

### Data Loader

Ζητείται να ανέβει ένα αρχείο. Έπειτα υπάρχει επιλογή "Show Data" όπου εμφανίζει τους πίνακες "Data table" και "Labels".

### 2D Visualization:

Υπάρχει η επιλογή οπτικοποιήσεων όπου αν επιλεχθεί οποιαδήποτε από αυτές εμφανίζονται οι κατάλληλες οπτικοποιήσεις.

### Machine Learning

Στην αρχή ζητείται να επιλεγεί κατηγοριοποίηση ή ομαδοποίηση. Έπειτα εμφανίζονται δύο sliders όπου ανάλογα την τιμή τους δίνεται ένας πίνακας και τα συγκρίνει. Επίσης, εμφανίζει ποιος αλγόριθμος είναι πιο αποδοτικός.

### Info

Τέλος υπάρχει η τρέχουσα σελίδα όπου αναγράφει χρήσιμες πληροφορίες.

## Ομάδα Ανάπτυξης

Νικόλαος Τρυπάκης inf202129, Σφηναρολάκης Στέφανος inf2021218, Ορέστης Ραφαήλ Μακρής inf2021129
             
- ### Data Loader
  Τo Data Frame ανέλαβε και ολοκλήρωσε ο Νίκος

- ### 2D Visualization
  Το 2D Visualization ανέλαβε και ολοκλήρωσε ο Νίκος
- ### Machine Learning
  ΟΙ αλγορίθμοι στο Machine Learning ανέλαβε και ολοκλήρωσε ο Ορέστης
  Οι συγκρίσεις στο Machine Learning ανέλαβε και ολοκλήρωσε ο Στέφανος         
- ### Info
  Την ανάπτυξη του Info ανέλαβε και ολοκλήρωσε ο Στεφανος

## Προφίλ στο GitHub (αποθετήριο εφαρμογής)

### Οργάνωση:
- Ομάδα: [github/TexnologiaLogismikouProject](https://github.com/TexnologiaLogismikouProject/sw)

### Μέλη:
- Νικόλαος Τρυπάκης: [github/inf2021229](https://github.com/inf2021229/sw)
- Ορέστης Ραφαήλ Μακρής: [github/inf2021129](https://github.com/inf2021129/sw)
- Σφηναρολάκης Στέφανος: [github/StefanosSfinarolakis](https://github.com/StefanosSfinarolakis/sw)
""")